# SheetAssemblyDescription Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..SheetAssemblyDescription Property
ParameterTypeId Class See Also
---
"Assembly: Description"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId SheetAssemblyDescription { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property SheetAssemblyDescription As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ SheetAssemblyDescription {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace